{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<s>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "!": 5,
      "'": 6,
      "-": 7,
      ".": 8,
      "/": 9,
      "3": 10,
      "7": 11,
      "9": 12,
      "<": 13,
      ">": 14,
      "?": 15,
      "a": 16,
      "b": 17,
      "c": 18,
      "d": 19,
      "e": 20,
      "f": 21,
      "g": 22,
      "h": 23,
      "i": 24,
      "j": 25,
      "k": 26,
      "l": 27,
      "m": 28,
      "n": 29,
      "o": 30,
      "p": 31,
      "q": 32,
      "r": 33,
      "s": 34,
      "t": 35,
      "u": 36,
      "v": 37,
      "w": 38,
      "x": 39,
      "y": 40,
      "z": 41,
      "ª": 42,
      "Ã": 43,
      "Ġ": 44,
      "</": 45,
      "en": 46,
      "oe": 47,
      "ie": 48,
      "la": 49,
      "an": 50,
      "ak": 51,
      "er": 52,
      "ch": 53,
      "ga": 54,
      "at": 55,
      "ba": 56,
      "ka": 57,
      "bo": 58,
      "je": 59,
      "ke": 60,
      "wa": 61,
      "ko": 62,
      "ma": 63,
      "sh": 64,
      "et": 65,
      "ri": 66,
      "kie": 67,
      "pp": 68,
      "ra": 69,
      "el": 70,
      "gga": 71,
      "ta": 72,
      "am": 73,
      "bi": 74,
      "na": 75,
      "on": 76,
      "ll": 77,
      "chi": 78,
      "ki": 79,
      "ro": 80,
      "ss": 81,
      "!</": 82,
      "ff": 83,
      "koe": 84,
      "lla": 85,
      "ti": 86,
      "be": 87,
      "ge": 88,
      "li": 89,
      "ne": 90,
      "se": 91,
      "to": 92,
      "wi": 93,
      "ken": 94,
      "me": 95,
      "pa": 96,
      "rie": 97,
      "sc": 98,
      "ek": 99
    },
    "merges": [
      [
        "<",
        "/"
      ],
      [
        "e",
        "n"
      ],
      [
        "o",
        "e"
      ],
      [
        "i",
        "e"
      ],
      [
        "l",
        "a"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "k"
      ],
      [
        "e",
        "r"
      ],
      [
        "c",
        "h"
      ],
      [
        "g",
        "a"
      ],
      [
        "a",
        "t"
      ],
      [
        "b",
        "a"
      ],
      [
        "k",
        "a"
      ],
      [
        "b",
        "o"
      ],
      [
        "j",
        "e"
      ],
      [
        "k",
        "e"
      ],
      [
        "w",
        "a"
      ],
      [
        "k",
        "o"
      ],
      [
        "m",
        "a"
      ],
      [
        "s",
        "h"
      ],
      [
        "e",
        "t"
      ],
      [
        "r",
        "i"
      ],
      [
        "k",
        "ie"
      ],
      [
        "p",
        "p"
      ],
      [
        "r",
        "a"
      ],
      [
        "e",
        "l"
      ],
      [
        "g",
        "ga"
      ],
      [
        "t",
        "a"
      ],
      [
        "a",
        "m"
      ],
      [
        "b",
        "i"
      ],
      [
        "n",
        "a"
      ],
      [
        "o",
        "n"
      ],
      [
        "l",
        "l"
      ],
      [
        "ch",
        "i"
      ],
      [
        "k",
        "i"
      ],
      [
        "r",
        "o"
      ],
      [
        "s",
        "s"
      ],
      [
        "!",
        "</"
      ],
      [
        "f",
        "f"
      ],
      [
        "k",
        "oe"
      ],
      [
        "l",
        "la"
      ],
      [
        "t",
        "i"
      ],
      [
        "b",
        "e"
      ],
      [
        "g",
        "e"
      ],
      [
        "l",
        "i"
      ],
      [
        "n",
        "e"
      ],
      [
        "s",
        "e"
      ],
      [
        "t",
        "o"
      ],
      [
        "w",
        "i"
      ],
      [
        "k",
        "en"
      ],
      [
        "m",
        "e"
      ],
      [
        "p",
        "a"
      ],
      [
        "r",
        "ie"
      ],
      [
        "s",
        "c"
      ],
      [
        "e",
        "k"
      ]
    ]
  }
}